# Например, если IP-адрес узла равен 131.32.255.131,
# а маска равна 255.255.240.0, то адрес сети равен 131.32.240.0.
# Для узла с IP- ад ре сом 117.191.208.37 адрес
# сети равен 117.191.192.0. Чему равно наи меньшее
# возможное значение третьего
# слева байта маски сети?
def k(ip):
    output = ''
    for i in ip.split('.'):
        output += f'{bin(int(i))[2:]:0>8} '
    return output
print('mask from statement ', k('255.255.240.0'))
print(k('131.32.255.131'))
print(k('131.32.240.0'))

print('mask from statement &')
print(k('117.191.208.37'))
print(k('117.191.192.0'))
